Chess/app/controllers/controls_controller.rb

  def champions
    @players = Player.all
---
SELECT "players".* FROM "players"

  def show
    @player = Player.find_by(id: params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def set_players
    @players = Player.all
---
SELECT  "players".* FROM "players" WHERE (3) LIMIT ?  [["LIMIT", 1]]